In [1]:
import pandas as pd

# 5.1 Introduction to pandas Data Structures

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

And so on...

In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

# create a Series with an index identifying each data point with a label:

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

# Compared with NumPy arrays, you can use labels in the index when selecting single values or a set of values:

In [10]:
obj2["a"]

-5

In [11]:
obj2["b"]

7

In [12]:
obj2["d"]

4

In [13]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    4
dtype: int64

# Using NumPy functions or NumPy-like operations, such as filtering with a Boolean array, scalar multiplication, or applying math functions, will preserve the index-value link:

In [14]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [15]:
import numpy as np

In [16]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

# Should you have data contained in a Python dictionary, you can create a Series from it by passing the dictionary:

In [17]:
sdata = {"Ohio":35000, "Texas":71000, "Oregon":16000, "Utah":5000}

In [18]:
obj3 = pd.Series(sdata)

In [19]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

# A Series can be converted back to a dictionary with its to_dict method:

In [20]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [21]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [22]:
obj4 = pd.Series(sdata, index=states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

#Here, three values found in sdata were placed in the appropriate locations, but since no value for "California" was found, it appears as NaN (Not a Number), which is considered in pandas to mark missing or NA values. Since "Utah" was not included in states, it is excluded from the resulting object.

I will use the terms “missing,” “NA,” or “null” interchangeably to refer to missing data. The isna and notna functions in pandas should be used to detect missing data

In [24]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [30]:
obj4.name = "population"

In [31]:
obj4.index.name = "state"

In [32]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [33]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [35]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame 
There are many ways to construct a DataFrame, though one of the most common is from a dictionary of equal-length lists or NumPy arrays:

In [36]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [37]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
#For large DataFrames, the head method selects only the first five rows:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
#Similarly, tail returns the last five rows:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
#If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [41]:
#If you pass a column that isn’t contained in the dictionary, it will appear with missing values in the result:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [42]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
#A column in a DataFrame can be retrieved as a Series either by dictionary-like notation or 
#by using the dot attribute notation:

frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [45]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [46]:
#Note that the returned Series have the same index as the DataFrame, and their name 
#attribute has been appropriately set.

#Rows can also be retrieved by position or name with the special iloc and loc attributes 
#(more on this later in Selection on DataFrame with loc and iloc):

frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [47]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [48]:
#Columns can be modified by assignment. 
#For example, the empty debt column could be assigned a scalar value or an array of values:

frame2["debt"] = 16.5

In [49]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [50]:
frame2["debt"] = np.arange(6.)

In [51]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [52]:
#When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. 
#If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, 
#inserting missing values in any index values not present:

val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [53]:
frame["debt"] = val

In [54]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [55]:
#Assigning a column that doesn’t exist will create a new column.

#The del keyword will delete columns like with a dictionary. 
#As an example, I first add a new column of Boolean values where the state column equals "Ohio":

frame2["eastern"] = frame2["state"] == "Ohio"

In [56]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   0.0     True
1  2001    Ohio  1.7   1.0     True
2  2002    Ohio  3.6   2.0     True
3  2001  Nevada  2.4   3.0    False
4  2002  Nevada  2.9   4.0    False
5  2003  Nevada  3.2   5.0    False

In [57]:
#New columns cannot be created with the frame2.eastern dot attribute notation.
#The del method can then be used to remove this column:

del frame2["eastern"]

In [58]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [59]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

In [60]:
#If the nested dictionary is passed to the DataFrame, 
#pandas will interpret the outer dictionary keys as the columns, 
#and the inner keys as the row indices:

frame3 = pd.DataFrame(populations)

In [61]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [62]:
#You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array:

frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [63]:
#The keys in the inner dictionaries are combined 
#to form the index in the result. This isn’t true if an explicit index is specified:

pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [64]:
#Dictionaries of Series are treated in much the same way:

pdata = {"Ohio": frame3["Ohio"][:-1], "Nevada": frame3["Nevada"][:2]}

In [65]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [66]:
#If a DataFrame’s index and columns have their name attributes set, these will also be displayed:

frame3.index.name = "year"

In [67]:
frame3.columns.name = "state"

In [68]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [69]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [70]:
#If the DataFrame’s columns are different data types, 
#the data type of the returned array will be chosen to accommodate all of the columns:

frame2.to_numpy()

array([[2000, 'Ohio', 1.5, 0.0],
       [2001, 'Ohio', 1.7, 1.0],
       [2002, 'Ohio', 3.6, 2.0],
       [2001, 'Nevada', 2.4, 3.0],
       [2002, 'Nevada', 2.9, 4.0],
       [2003, 'Nevada', 3.2, 5.0]], dtype=object)

# Index Objects

In [130]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [131]:
index = obj.index

In [132]:
index

Index(['a', 'b', 'c'], dtype='object')

In [133]:
index[1:]

Index(['b', 'c'], dtype='object')

In [134]:
#Index objects are immutable and thus can’t be modified by the user:

index[1] = "d"  # TypeError

TypeError: Index does not support mutable operations

In [135]:
#Immutability makes it safer to share Index objects among data structures:

labels = pd.Index(np.arange(3))

In [82]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [83]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [84]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [85]:
#In addition to being array-like, an Index also behaves like a fixed-size set:

frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [86]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [87]:
"Ohio" in frame3.columns

True

In [88]:
2003 in frame3.index

False

In [89]:
#Unlike Python sets, a pandas Index can contain duplicate labels:

pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# 5.2 Essential Functionality

# Reindexing

In [90]:
#An important method on pandas objects is reindex, 
#which means to create a new object with the values rearranged to align with the new index. 
#Consider an example:

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [91]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [92]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [93]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [94]:
#For ordered data like time series, you may want to do some interpolation or filling of values when reindexing. 
#The method option allows us to do this, using a method such as ffill, which forward-fills the values:

obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [95]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [96]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [97]:
#With DataFrame, reindex can alter the (row) index, columns, or both. 
#When passed only a sequence, it reindexes the rows in the result:

frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=["a", "c", "d"],columns=["Ohio", "Texas", "California"])

In [98]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [99]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])

In [100]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [101]:
states = ["Texas", "Utah", "California"]

In [102]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [103]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [104]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

# Dropping Entries from an Axis

In [105]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [106]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [107]:
new_obj = obj.drop("c")

In [108]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [109]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [110]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=["Ohio", "Colorado", "Utah", "New York"],columns=["one", "two", "three", "four"])

In [111]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [113]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [114]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [115]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

# Indexing, Selection, and Filtering

In [146]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [147]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [148]:
obj["b"]

1.0

In [149]:
obj[1]

1.0

In [150]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [151]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [152]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [153]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [154]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [155]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [156]:
obj1

2    1
0    2
1    3
dtype: int64

In [157]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [158]:
obj2

a    1
b    2
c    3
dtype: int64

In [159]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [160]:
obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [161]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [162]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [163]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [164]:
obj2.loc["b":"c"] = 5

In [165]:
obj2

a    1
b    5
c    5
dtype: int64

In [166]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"], 
                    columns=["one", "two", "three", "four"])

In [167]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [168]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [169]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [170]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [171]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [172]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [173]:
data[data < 5] = 0

In [174]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [175]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [176]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [177]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [178]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [179]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [180]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [181]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [182]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [183]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [184]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [185]:
ser = pd.Series(np.arange(3.))

In [186]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [187]:
ser[-1]

KeyError: -1

In [188]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [189]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [190]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [191]:
ser2[-1]

2.0

In [192]:
ser.iloc[-1]

2.0

In [193]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [194]:
data.loc[:, "one"] = 1

In [195]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [196]:
data.iloc[2] = 5

In [197]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [198]:
data.loc[data["four"] > 5] = 3

In [199]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [200]:
data.loc[data.three == 5, "three"] = 6

In [201]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [202]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [203]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
   .....:                index=["a", "c", "e", "f", "g"])

In [204]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [205]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [206]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [207]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
   .....:                    index=["Ohio", "Texas", "Colorado"])

In [208]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
   .....:                    index=["Utah", "Ohio", "Texas", "Oregon"])

In [209]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [210]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [211]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [212]:
df2 + df1

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [213]:
df1 = pd.DataFrame({"A": [1, 2]})

In [214]:
df2 = pd.DataFrame({"B": [3, 4]})

In [215]:
df1

   A
0  1
1  2

In [216]:
df2

   B
0  3
1  4

In [217]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [218]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))

In [219]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [220]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
   .....:                    columns=list("abcde"))

In [221]:
df2.loc[1, "b"] = np.nan

In [222]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [223]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [224]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [225]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [226]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [227]:
arr = np.arange(12.).reshape((3, 4))

arr

In [228]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [229]:
arr[0]

array([0., 1., 2., 3.])

In [230]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [231]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
   .....:                      columns=list("bde"),
   .....:                      index=["Utah", "Ohio", "Texas", "Oregon"])

In [232]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [233]:
series = frame.iloc[0]

In [234]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [235]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [236]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [237]:
series2

b    0
e    1
f    2
dtype: int64

In [238]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [239]:
series3 = frame["d"]

In [240]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [241]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [242]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [243]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
   .....:                      columns=list("bde"),
   .....:                      index=["Utah", "Ohio", "Texas", "Oregon"])

In [244]:
frame

               b         d         e
Utah    1.468405  0.901945  0.638903
Ohio   -1.425890 -1.591669  0.939619
Texas  -0.694457 -0.650855 -0.128809
Oregon  0.990129  0.841266 -1.326083

In [245]:
np.abs(frame)

               b         d         e
Utah    1.468405  0.901945  0.638903
Ohio    1.425890  1.591669  0.939619
Texas   0.694457  0.650855  0.128809
Oregon  0.990129  0.841266  1.326083

In [246]:
def f1(x):
   .....:     return x.max() - x.min()

In [247]:
frame.apply(f1)

b    2.894295
d    2.493615
e    2.265702
dtype: float64

In [248]:
frame.apply(f1, axis="columns")

Utah      0.829502
Ohio      2.531288
Texas     0.565648
Oregon    2.316212
dtype: float64

In [249]:
def f2(x):
   .....:     return pd.Series([x.min(), x.max()], index=["min", "max"])

In [250]:
frame.apply(f2)

            b         d         e
min -1.425890 -1.591669 -1.326083
max  1.468405  0.901945  0.939619

In [251]:
def my_format(x):
   .....:     return f"{x:.2f}"

In [252]:
frame.applymap(my_format)

            b      d      e
Utah     1.47   0.90   0.64
Ohio    -1.43  -1.59   0.94
Texas   -0.69  -0.65  -0.13
Oregon   0.99   0.84  -1.33

In [253]:
frame["e"].map(my_format)

Utah       0.64
Ohio       0.94
Texas     -0.13
Oregon    -1.33
Name: e, dtype: object

In [254]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [255]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [256]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [257]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
   .....:                      index=["three", "one"],
   .....:                      columns=["d", "a", "b", "c"])

In [258]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [259]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [260]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [261]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [262]:
obj = pd.Series([4, 7, -3, 2])

In [263]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [264]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [265]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [266]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [267]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [268]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [269]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [270]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [271]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [272]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [273]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [274]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [275]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
   .....:                       "c": [-2, 5, 8, -2.5]})

In [276]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [277]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [278]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [279]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [280]:
obj.index.is_unique

False

In [281]:
obj["a"]

a    0
a    1
dtype: int64

In [282]:
obj["c"]

4

In [283]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
   .....:                   index=["a", "a", "b", "b", "c"])

In [284]:
df

          0         1         2
a  1.317751 -0.216135 -0.211945
a  2.927148 -0.160706 -0.615893
b  0.786371 -0.250721 -1.344650
b  0.232432  0.313618 -1.142169
c  0.758329 -0.000787 -0.955796

In [285]:
df.loc["b"]

          0         1         2
b  0.786371 -0.250721 -1.344650
b  0.232432  0.313618 -1.142169

In [286]:
df.loc["c"]

0    0.758329
1   -0.000787
2   -0.955796
Name: c, dtype: float64

In [287]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
   .....:                    [np.nan, np.nan], [0.75, -1.3]],
   .....:                   index=["a", "b", "c", "d"],
   .....:                   columns=["one", "two"])

In [288]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [289]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [290]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [291]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [292]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [293]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [294]:
df.idxmax()

one    b
two    d
dtype: object

In [295]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [296]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [297]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [298]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [299]:
#price = pd.read_pickle("examples/yahoo_price.pkl")

In [300]:
#volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [301]:
#returns = price.pct_change()

In [302]:
#returns["MSFT"].corr(returns["IBM"])

In [303]:
#returns["MSFT"].cov(returns["IBM"])

In [304]:
#returns.corr()

In [305]:
#returns.cov()

In [306]:
#returns.corrwith(returns["IBM"])

In [307]:
#returns.corrwith(volume)

In [308]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [309]:
uniques = obj.unique()

In [310]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [311]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [312]:
pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [313]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [314]:
mask = obj.isin(["b", "c"])

In [315]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [316]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [317]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [318]:
unique_vals = pd.Series(["c", "b", "a"])

In [319]:
indices = pd.Index(unique_vals).get_indexer(to_match)

In [320]:
indices

array([0, 2, 1, 1, 0, 2])

#isin - Compute a Boolean array indicating whether each Series or DataFrame value is contained in the passed sequence of values

get_indexer - Compute integer indices for each value in an array into another array of distinct values; helpful for data alignment and join-type operations

unique - Compute an array of unique values in a Series, returned in the order observed

value_counts - Return a Series containing unique values as its index and frequencies as its values, ordered count in descending order

In [321]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
   .....:                      "Qu2": [2, 3, 1, 2, 3],
   .....:                      "Qu3": [1, 5, 2, 4, 4]})

In [322]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [323]:
data["Qu1"].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [324]:
result = data.apply(pd.value_counts).fillna(0)

In [325]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [326]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})

In [327]:
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [328]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
dtype: int64